{
  "name": "Bias Callouts",
  "content": "## Objective\nSurface and neutralize the cognitive biases most likely to distort the user’s decision before they commit to a course of action.\n\n## Context\n- Apply Munger’s latticework and Kahneman System 1/2 framing.\n\n## Inputs\n- situation: {{situation}}\n\n## Assumptions\nAssumption: Ask one concise clarifying question only if it would change which biases are most relevant.\nAssumption: Otherwise proceed and record assumptions before analysis.\n\n## Constraints\n- Use specific bias names and cite mental models/sources.\n- Keep language neutral and actionable.\n\n## Instructions\n1. Situation scan — Summarize decision, stakes, actors, timing in ≤3 sentences.\n2. Trigger detection — Flag cues for bias families (incentives, social proof, loss aversion, time pressure, novelty, confirmation).\n3. Bias diagnosis — Select 3–6 biases; explain causal signal from {{situation}} and cite a source (Munger/Kahneman/Duke/research).\n4. Countermeasures — Pair each bias with practical interventions incl. owner/timing when available.\n5. Reflection prompt — One forward-looking System 2 question.\n\n## Execution Flow\n1) Scan\n2) Detect\n3) Diagnose\n4) Counter\n5) Reflect\n\n## Output Format\n1. Decision Snapshot — 2–3 sentences covering goal, stakes, timing, and key assumptions.\n2. Bias Callouts — Table: Bias / Mental Model | Why triggered here | Source | Counter-bias tactic.\n3. System 2 Guardrails — Bulleted checklist enforcing deliberate thinking.\n4. Reflection Question — Single open-ended prompt.\n\n## Quality Checks\n- Every bias is tied to a specific signal in {{situation}}.\n- Countermeasures are concrete, time-bound, and owned (or TBD).\n- Citations reference recognized sources or named mental models.\n- Reflection question invites further de-biasing.\n- All assumptions due to missing context are explicitly labeled.\n\n## Eval Stubs\n- pass_if(bias_count >= 3 && bias_count <= 6)\n- pass_if(has_countermeasures == true)\n- pass_if(has_citations == true)",
  "description": "This template stress-tests decisions for cognitive biases to help you make better choices by surfacing hidden distortions before committing. It identifies 3-6 biases triggered by your situation (loss aversion, confirmation bias, etc.), cites mental models (Munger, Kahneman), and provides concrete countermeasures. Output: bias callout table with triggers/sources/tactics, System 2 guardrails checklist, and reflection question. Use before major decisions, strategic planning, or when stakes are high and emotions run strong.",
  "trigger": ":bias_callout",
  "variables": [
    {
      "name": "situation",
      "label": "Decision situation or narrative to stress-test for cognitive bias (include context, actors, stakes)",
      "multiline": true
    }
  ]
}