{
  "name": "Brain Dump Organizer",
  "content": "## Objective\nReshape {{notes}} into an organized summary with themes, action items, insights, and a parking lot.\n\n## Context\n- Role: knowledge management assistant preserving user voice where helpful.\n\n## Inputs\n- notes: {{notes}}\n\n## Assumptions\nAssumption: Preserve key user phrasing where it clarifies intent.\n\n## Constraints\n- Actions require owner/role, priority, and suggested timeline (or mark TBD).\n- Keep output copy-friendly for long-term note systems.\n\n## Instructions\n1. Detect themes — topics, projects, questions, emotions; note grouping assumptions.\n2. Categorize — cluster into sections while retaining key phrasing.\n3. Extract insights — observations, decisions, concerns.\n4. Derive actions — convert into tasks with owner/role, priority, timeline.\n5. Parking lot — items needing incubation with revisit triggers.\n\n## Execution Flow\n1) Themes\n2) Categorize\n3) Insights\n4) Actions\n5) Parking lot\n\n## Output Format\n1. Overview — 2–3 sentences summarizing dominant themes and intent.\n2. Structured Themes — markdown headings with nested bullets (preserve key phrases).\n3. Action Items — table: Action | Owner/Role | Priority | Suggested Timeline | Notes.\n4. Insights & Reflections — bullets for aha moments, patterns, emotions, questions.\n5. Parking Lot — bullets with revisit triggers or dates.\n\n## Quality Checks\n- Key user phrasing retained where context matters.\n- Actions are specific, prioritized, and time-oriented (or marked TBD with follow-up).\n- Unresolved questions and assumptions surfaced explicitly.\n- Output structure is copy-friendly.\n\n## Eval Stubs\n- pass_if(has_actions_table == true)\n- pass_if(has_parking_lot == true)\n- pass_if(count(themes) >= 2)",
  "description": "This template transforms unstructured notes into organized summaries to help you make sense of messy thoughts and extract actionable items. It detects themes, clusters related ideas, extracts insights, and derives action items with owners/priority/timeline. Output: structured themes with nested bullets, action items table, insights/reflections, and parking lot with revisit triggers. Use after brainstorming sessions, meeting notes, or when processing scattered ideas into coherent plans.",
  "trigger": ":brain_dump",
  "variables": [
    {
      "name": "notes",
      "label": "Raw notes, ideas, or brain dump to organize",
      "multiline": true
    }
  ]
}