{
  "name": "Context-Aware Troubleshooter",
  "content": "## Objective\nTransform {{issue}} into a structured investigation plan, concrete fixes, and safeguards that prevent recurrence.\n\n## Context\n\n## Inputs\n- issue: {{issue}}\n\n## Assumptions\nAssumption: Proceed with explicit assumptions when information is missing.\nAssumption: No external browsing; rely on provided artifacts only.\n\n## Constraints\n- Ask at most one clarifying question (≤30 words) only if a single missing fact truly blocks progress.\n- Otherwise, continue and log assumptions.\n- Keep language concise; technical and actionable.\n\n## Instructions\n- Summarize the situation (symptoms, environment, recent changes) and tag what is unknown.\n- Build a Known vs Unknown matrix: runtime, platform, dependencies, configs, data, deployments, user impact.\n- Generate layered hypotheses (infra, platform, app, data, external services) tied to signals from {{issue}}.\n- For each hypothesis, list decisive diagnostics/repro steps and expected signals.\n- Prioritize actions (P0 immediate, P1 next, P2 later) with owners/roles where implied and rollback notes.\n- Recommend prevention (monitoring, alerts, tests, docs) mapped to likely root causes.\n\n## Execution Flow\n1. Situation summary\n2. Known vs Unknown matrix\n3. Hypotheses with evidence\n4. Diagnostics plan\n5. Action plan with priorities\n6. Prevention & resilience\n\n## Output Format\n1. Situation Summary — 2–3 sentences on the issue, assumptions, and whether a clarifying question was asked.\n2. Context Checklist — Known vs Unknown bullets for environment/configs/data/dependencies/changes.\n3. Hypotheses & Tests — Table: Hypothesis | Evidence | Diagnostic step | Proposed fix | Confidence.\n4. Action Plan — P0/P1/P2 ordered list with tasks, owner/role (or TBD), expected outcome.\n5. Prevention & Observability — Bulleted safeguards tied to hypotheses.\n6. Outstanding Questions — Items to confirm or supply.\n\n## Quality Checks\n- At most one clarifying question; assumptions logged.\n- Known vs Unknown structured and complete.\n- Hypotheses map to decisive diagnostics and fixes.\n- Action plan prioritized with clear outcomes and owners/TBD.\n- Prevention guidance is actionable and tied to causes.\n\n## Eval Stubs\n- pass_if(clarifying_questions_used <= 1)\n- pass_if(has_known_unknowns == true)\n- pass_if(has_p0_tasks == true)\n\n## Self-Check\nIf any Quality Check would fail, revise once before returning.",
  "description": "This template fixes bugs and generates comprehensive test coverage to help you prevent regression while resolving issues. It diagnoses the bug, implements the fix, and creates edge case tests (including negative cases). Output: bug fix code, new test suite with ≥3 test cases, and validation that tests fail pre-fix and pass post-fix. Use when bug fixing should include test hardening to prevent similar issues.",
  "trigger": ":context-aw",
  "variables": [
    {
      "name": "issue",
      "label": "Problem description, logs, or symptoms (include anything known about environment or recent changes)",
      "multiline": true
    }
  ]
}