{
  "name": "Deep Analysis / Decision Matrix",
  "content": "## Objective\nDiagnose the core issue behind {{decision}}, compare viable paths with a scored matrix, and recommend the most resilient course of action.\n\n## Context\n- Facilitator mode: Socratic probing, 5 Whys, outcome mapping.\n\n## Inputs\n- decision: {{decision}}\n\n## Assumptions\nAssumption: Ask one clarifying round (3–4 questions) if it would change the recommendation.\nAssumption: Otherwise proceed and log assumptions explicitly.\n\n## Constraints\n- Keep language concise and evidence-aware.\n- At most one follow-up question after the initial round if it materially changes the outcome.\n\n## Instructions\n1. Frame the problem — Summarize context, stakeholders, outcomes, constraints, and assumptions in ≤4 sentences.\n2. Root cause ladder — Run a 5 Whys (or equivalent) toward controllable causes; note uncertainties.\n3. Option design — List realistic options with prerequisites, resources, alignment.\n4. Outcome mapping — For each option, outline Good/Okay/Bad scenarios with indicators and reversibility.\n5. Decision matrix — Score options on impact, effort, risk, reversibility, timeframe; call out weights.\n6. Recommendation — Choose a path; define success metrics, checkpoints, contingency triggers, follow-up questions.\n\n## Execution Flow\n1) Clarifying questions (if needed)\n2) Analysis steps (1–6)\n3) Emit output format\n\n## Output Format\n1. Situation Recap — Short paragraph covering context, assumptions, and whether clarifying questions were answered or inferred.\n2. Root Cause Ladder — Numbered list of the 5 Whys (or equivalent) ending in controllable causes plus open questions.\n3. Decision Matrix — Markdown table: Option | Impact | Effort | Risk | Reversibility | Timeframe | Notes.\n4. Outcome Mapping — Subsections per option (Good / Okay / Bad) with triggers and leading indicators.\n5. Recommended Path — Narrative plus bullet list detailing rationale, immediate next steps, metrics, and contingency plan.\n6. Follow-on Questions — 2–3 targeted prompts for stakeholders to validate assumptions or gather data.\n\n## Quality Checks\n- Assumptions explicitly labeled where answers are missing.\n- Root cause ladder terminates at actionable factors; confidence noted.\n- Matrix uses consistent criteria and scoring.\n- Outcome mapping includes indicators and reversibility.\n- Recommendation aligns with goals and defines checkpoints.\n\n## Eval Stubs\n- pass_if(matrix_has_columns == true)\n- pass_if(has_root_cause_ladder == true)\n- pass_if(recommendation_includes_metrics == true)",
  "description": "This template systematically collects and evaluates evidence for claims to help you build fact-based arguments and avoid confirmation bias. It searches for supporting evidence, contradicting evidence, and quality signals (source credibility, recency, bias). Output: evidence matrix with pro/con items, source quality ratings, confidence assessment, and knowledge gaps. Use when researching claims, validating assumptions, or building evidence-based proposals.",
  "trigger": ":deep_analy",
  "variables": [
    {
      "name": "decision",
      "label": "Decision, challenge, or problem to dissect (include known facts, symptoms, constraints)",
      "multiline": true
    }
  ]
}