{
  "name": "Deep Research Summary",
  "content": "## Objective\nProduce a comprehensive, length-aware summary from a single input (URL, document text, or long passage). Preserve objectives and critical details while scaling depth to source length and complexity.\n\n## Context\n- Role: expert research analyst.\n- Inputs may be: a URL, a pasted document, or a URL followed by additional user context (user context supersedes URL content if conflicts arise).\n\n## Inputs\n- source: {{source}}\n\n## Assumptions\nAssumption: If {{source}} includes a URL plus appended user context, treat user context as authoritative over the URL.\nAssumption: If the URL cannot be fetched here, treat it as a citation; summarize provided text and user context only.\nAssumption: Short (<600 words, 1–2 sections) → brevity; Long (≥600 words or ≥3 sections) → structured expansion.\nAssumption: Reconstruct tables in Markdown/ASCII and translate content into English.\n\n## Constraints\n- Faithfulness: no fabrication; mark uncertainties clearly.\n- Length-aware: scale detail to source; include key figures, timelines, decisions.\n- Clarity: plain language, readable headings, scannable lists.\n- Inline citations for key facts, metrics, quotes.\n- Numbers/dates: present exactly as found.\n\n## Instructions\nApply these rules rigorously:\n- Identify purpose, scope, audience (if implied), and primary conclusions.\n- Extract critical points, figures, and decisions; avoid guesswork.\n- Adjust depth by source length/complexity (short: concise summary + 3–6 bullets; long: multi-section summary).\n- Highlight high-risk or high-uncertainty sections for the reader to review closely (for example: unsupported claims, single-source critical facts, missing data, or sections that would materially affect decisions).\n- Whenever you reference facts, figures, quotes, or claims that rely on the source or external material, include inline citations or explicit source pointers (URL, section heading, or quoted excerpt).\n- Explicitly note model constraints and analysis limits where they meaningfully affect the summary (for example: source exceeds context length limits, instruction ambiguity, missing clarifying details, or when content appears to require specialist domain tools).\n- For long/complex sources include: Background; Methods/Approach; Findings; Implications; Risks & Mitigations; Open Questions.\n- Prefer exact terms for entities, metrics, dates; define technical terms briefly.\n- Call out contradictions or gaps explicitly.\n- If only a URL without retrievable content, summarize included excerpts/context and note that external fetching was not performed.\n\n## Execution Flow\n1) Parse {{source}}; if URL + user context, treat user context as authoritative.\n2) Detect length/complexity (short vs long).\n3) Extract objectives, key findings, decisions, metrics, timelines.\n4) Draft sections, scaling detail appropriately.\n5) Run quality checks and refine.\n\n## Output Format\n1. Executive Summary — 3–6 sentences on purpose, findings, conclusions; note key outcomes or decisions.\n2. Length-Aware Depth — short: 3–6 bullets; long: subsections (Background, Methods/Approach, Findings, Implications, Risks & Mitigations, Open Questions).\n3. Major Callouts / Key Takeaways — bullets with metrics (%, $, counts), timelines, or decisions, with inline citations.\n4. Supporting Details (as needed) — structured deep-dive; include reconstructed tables.\n5. Notes on Accuracy & Gaps — uncertainties, missing data, contradictions without speculation.\n\n## Quality Checks\n- Completeness: essential points captured; critical metrics and decisions included.\n- Faithfulness: no invented facts; uncertainties labeled.\n- Structure: headings/lists enable rapid scanning; brief definitions for niche terms.\n- Length Fit: depth matches source complexity.\n\n## Eval Stubs\n- pass_if(all_numbers_and_dates_preserved == true)\n- pass_if(has_length_aware_structure == true)\n- pass_if(has_citations_for_key_facts == true)\n\n## Self-Check\n- Did I scale depth appropriately?\n- Are callouts actionable with figures/dates/decisions?\n- Did I avoid guessing and label gaps?\n- Is the Executive Summary 3–6 sentences and complete?\n- Are reconstructed tables present and readable?",
  "description": "This template produces comprehensive research summaries with depth and rigor to help you analyze complex topics thoroughly. It examines multiple perspectives, evaluates evidence quality, identifies knowledge gaps, and synthesizes findings. Output: detailed analysis with methodology, findings, confidence levels, and research gaps. Use for academic research, policy analysis, or when superficial understanding is insufficient.",
  "trigger": ":deep_resea",
  "variables": [
    {
      "name": "source",
      "label": "Source (URL or pasted content; may include extra context after the link)",
      "multiline": true
    }
  ]
}