{
  "name": "How To Decide Principles and Best Practices",
  "content": "## Objective\nGuide the user to a defensible recommendation by classifying door type, exposing assumptions/biases, quantifying trade-offs, and defining next actions with monitoring hooks.\n\n## Context\n- Draw on Annie Duke’s How to Decide and Bezos’ one-way/two-way door framing.\n\n## Inputs\n- decision: {{decision}}\n\n## Assumptions\nAssumption: Ask ≤2 clarifying questions only if they could change classification or top option.\nAssumption: Otherwise proceed and log assumptions.\n\n## Constraints\n- Keep reasoning concise and evidence-backed; cite the principle used.\n\n## Instructions\n1. Context scan — Objectives, stakeholders, stakes, constraints, timing (≤4 sentences).\n2. Door test — One-way vs two-way with reversibility, time pressure, confidence.\n3. Assumptions & bias risks — Table with confidence levels; tie to Duke/Munger/Kahneman with mitigation.\n4. Options & outcomes — Table with upside, downside, most likely, trade-offs, safeguards.\n5. Expected value — Likelihoods, pivotal uncertainties, value of more info.\n6. Stress-test — Failure modes, safeguards, reversible experiments/staged bets.\n7. Recommendation — Choice, rationale, triggers/metrics for reassessment.\n\n## Execution Flow\n1) Optional clarifying questions (≤2)\n2) Perform steps 1–7\n3) Emit output format\n\n## Output Format\n1. Decision Snapshot — 3–4 sentences covering problem, stakes, door type, reversibility window, decision horizon.\n2. Assumptions & Confidence — Table: Assumption | Confidence (H/M/L) | Evidence/Gap | Bias risk & mitigation.\n3. Options vs Outcomes — Table: Option | Upside | Downside | Most likely | Key trade-offs | Safeguards.\n4. Expected Value & Sensitivities — Bullets summarizing likelihood-weighted view, pivotal uncertainties, and high-value tests.\n5. Recommendation & Next Steps — Paragraph plus bullets for immediate actions, monitoring metrics, revisit triggers.\n\n## Quality Checks\n- Door classification explicit with justification.\n- Assumptions include confidence, evidence status, and mitigation/test.\n- Trade-offs balance qualitative and quantitative factors with cited principles.\n- Recommendation includes next steps and revisit metrics.\n- All assumptions/inferred data clearly labeled.\n\n## Eval Stubs\n- pass_if(has_door_classification == true)\n- pass_if(assumptions_table_rows >= 3)\n- pass_if(options_table_has_columns == true)\n\n## Self-Check\nIf any Quality Check would fail, revise once before returning.",
  "description": "This template structures complex decisions using systematic frameworks to help you evaluate options rigorously and make defensible choices. It applies decision matrices, cost-benefit analysis, and risk assessment to weigh alternatives objectively. Output: structured decision analysis with scored options, trade-off summary, and recommended choice with rationale. Use for strategic choices, resource allocation, architecture decisions, or when options have unclear trade-offs.",
  "trigger": ":how_to_dec",
  "variables": [
    {
      "name": "decision",
      "label": "Decision or choice to evaluate (include goals, stakeholders, stakes, and any time constraints)",
      "multiline": true
    }
  ]
}