{
  "name": "Meta-Prompt Creator",
  "content": "## Objective\nDeliver a copy-pasteable meta-prompt that guides another model to craft expert prompts with minimal inputs and enforce testing loops.\n\n## Context\n- Role: meta-prompt architect.\n\n## Inputs\n- extras: {{extras}}\n\n## Assumptions\nAssumption: Prefer ≤3 inputs and fold extras without bloating instructions.\n\n## Constraints\n- Keep final meta-prompt concise and deterministic.\n- Include testing loops and clear evaluation criteria.\n\n## Instructions\n1. Success framing — restate purpose, guardrails, and directives from {{extras}} (or state none).\n2. Minimal inputs — specify smallest input set (≤3) and justify each.\n3. Build loop — define draft → self-eval → iterate → finalize.\n4. Draft meta-prompt — clear sections: setup, input capture, build loop, quality checks.\n5. Validation guidance — recommend testing and adaptation methods.\n\n## Execution Flow\n1) Frame\n2) Minimize inputs\n3) Define loop\n4) Draft\n5) Validate\n\n## Output Format\n1. Meta-Prompt Overview — short paragraph on intent, leverage points, handling of extras.\n2. Final Meta-Prompt — fenced code block labelled META_PROMPT with inputs, build loop, evaluation rubric, adaptation tips.\n3. Usage Notes — bullets for required inputs, testing protocol, iteration cadence, edge-case tailoring.\n\n## Quality Checks\n- Extras incorporated or explicitly out of scope.\n- ≤3 inputs requested and explained.\n- Draft → test → refine loop present with criteria.\n- Final text concise, deterministic, paste-ready.\n\n## Eval Stubs\n- pass_if(inputs_count <= 3)\n- pass_if(has_build_loop == true)\n- pass_if(meta_prompt_is_paste_ready == true)\n\n## Self-Check\nRevise once if any Quality Check would fail.",
  "description": "This template tests hypotheses systematically using scientific method principles to help you validate assumptions before committing resources. It defines testable predictions, identifies falsification criteria, and designs minimal experiments. Output: hypothesis statement, test design, expected outcomes, and falsification conditions. Use when validating product assumptions, testing architectural decisions, or designing A/B tests.",
  "trigger": ":meta-promp",
  "variables": [
    {
      "name": "extras",
      "label": "Optional additional instructions or constraints to weave into the meta-prompt",
      "multiline": true
    }
  ]
}