{
  "name": "Project Creator then Assessor",
  "content": "## Objective\nTurn {{goals}} into a fully scoped project blueprint, then stress-test the plan before sign-off.\n\n## Context\n- Role: project architect and reviewer.\n\n## Inputs\n- goals: {{goals}}\n\n## Assumptions\nAssumption: Exactly three rounds of three follow-up questions (Rounds 1–3); proceed with assumptions if answers are missing.\nAssumption: Do not start planning until all rounds complete and insights summarized.\n\n## Constraints\n- Keep outputs concise and actionable; tables where specified.\n\n## Instructions\n1. Question rounds — Output Round 1–3 with exactly three questions each; capture answers or assumptions.\n2. Discovery synthesis — Summarize goals, constraints, stakeholders, resources, dependencies, unknowns.\n3. Project structuring — Define workstreams, milestones, deliverables, owners/roles, dependencies, timelines.\n4. Execution backlog — Tasks per milestone with acceptance criteria, estimates, and measurement hooks.\n5. Risk & mitigation — Strategic/operational/delivery risks with impact, likelihood, mitigations, triggers.\n6. Assessment — Evaluate alignment, resources, sequencing, readiness; flag unresolved decisions.\n7. Monitoring setup — KPIs, review cadence, tooling, escalation paths.\n\n## Execution Flow\n1) Rounds 1–3 questions\n2) Synthesis\n3) Blueprint\n4) Backlog\n5) Risks\n6) Assessment\n7) Monitoring\n\n## Output Format\n1. Question Rounds — Sections for Round 1–3 with exactly three numbered questions each (note assumptions).\n2. Discovery Synthesis — Bulleted summary of confirmed facts, assumptions, and open items.\n3. Project Blueprint — Table: Workstream | Milestone | Deliverables | Owner/Role | Due date (estimate) | Dependencies | Acceptance criteria.\n4. Execution Backlog — Ordered list grouped by milestone with tasks, effort/duration, success measures, owners/TBD.\n5. Risk Register — Table: Risk | Category | Impact | Likelihood | Mitigation | Trigger to revisit.\n6. Assessment & Recommendations — Narrative plus go/no-go checklist with prerequisites.\n7. Monitoring Plan — Bullets for KPIs, instrumentation, review cadence, escalation paths.\n\n## Quality Checks\n- Exactly three questions per round.\n- Synthesis includes confirmed data and gaps.\n- Blueprint covers scope, owners, dependencies, timelines, acceptance criteria.\n- Risks include owners/triggers; cover strategic and execution layers.\n- Assessment states readiness and blockers.\n\n## Eval Stubs\n- pass_if(rounds == 3 && questions_per_round == 3)\n- pass_if(has_blueprint_table == true)\n- pass_if(has_risk_register == true)",
  "description": "This template transforms high-level goals into fully scoped project blueprints with risk assessment to help you plan complex initiatives systematically. It runs 3 rounds of clarifying questions, structures workstreams/milestones/deliverables, and stress-tests the plan before sign-off. Output: project blueprint with tasks, risk matrix, KPIs, and readiness assessment. Use when starting new projects, scoping initiatives, or converting ideas into actionable plans with resource allocation.",
  "trigger": ":project_cr",
  "variables": [
    {
      "name": "goals",
      "label": "High-level goals, idea, or opportunity to turn into a project (include any context you already know)",
      "multiline": true
    }
  ]
}