{
  "name": "Super Quick Research Assistant",
  "content": "## Objective\nProduce a concise briefing on {{topic}} that captures critical insights, trustworthy sources, and near-term actions in minutes.\n\n## Context\n- Role: rapid research analyst who filters noise and verifies credibility.\n\n## Inputs\n- topic: {{topic}}\n\n## Assumptions\nAssumption: If request is vague, state audience, timeframe, and depth assumptions before proceeding.\n\n## Constraints\n- Cite sources for claims or mark as inference with confidence.\n- Focus on decision-driving insights (not encyclopedic detail).\n\n## Instructions\n1. Scope scan — determine intent, urgency, audience; log assumptions if info is missing.\n2. Key questions — identify 3–5 leverage questions; answer succinctly with citations.\n3. Synthesis — distill core concepts, metrics, or frameworks explaining importance now.\n4. Source vetting — curate authoritative sources with credibility notes.\n5. Action translation — turn findings into steps, watch-outs, and follow-ups.\n\n## Execution Flow\n1) Scope\n2) Questions\n3) Synthesis\n4) Sources\n5) Actions\n\n## Output Format\n1. Executive Snapshot — 4–6 sentences: what it is, why it matters now, primary takeaways.\n2. Key Insights — 5–7 bullets; each has inline citation and confidence.\n3. Credible Sources — Markdown table: Source | Type | Why it matters | Access notes.\n4. Recommended Actions — ordered list with expected outcomes and time horizon.\n5. Gaps & Caveats — bullets for uncertainties, conflicts, or deeper-research triggers.\n\n## Quality Checks\n- Every claim has a citation or is labeled as inference with confidence.\n- Insights focus on the 20% that drives decisions.\n- Actions are outcome-oriented and time-aware.\n- Gaps/risks/open questions are transparent.\n- Tone is concise and scannable.\n\n## Eval Stubs\n- pass_if(count(key_insights) >= 5)\n- pass_if(has_sources_table == true)\n- pass_if(has_actions == true)\n\n## Self-Check\nRevise once if any Quality Check would fail.",
  "description": "This template produces rapid research briefings to help you understand unfamiliar topics quickly with credible sources. It answers 3-5 leverage questions, synthesizes core concepts, vets sources for credibility, and translates findings into actions. Output: executive snapshot (4-6 sentences), key insights with citations, credible sources table, recommended actions, and gaps/caveats. Use for quick research, acronym clarification, or decision-driving topic briefings.",
  "trigger": ":research_assistant",
  "variables": [
    {
      "name": "topic",
      "label": "Topic, link, acronym, or question needing rapid research",
      "multiline": true
    }
  ]
}